waypoint_tracker.org
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS:
#+LATEX_HEADER:
#+LATEX_HEADER_EXTRA:
#+DESCRIPTION:
#+KEYWORDS:
#+SUBTITLE:
#+LATEX_COMPILER: pdflatex
#+DATE: \today

#+TITLE: Waypoint Traceback

This is a super class to capture the common functionality of waypoint updater and tl_dectector for
waypoint related functionality.

* WaypointTracker

A super-class for both WaypointTracker and TLDetector

** Top level
#+NAME:waypoint-tracker
#+BEGIN_SRC python :noweb tangle :tangle ./ros/src/waypoint_lib/src/waypoint_lib/waypoint_tracker.py
  import copy
  import math
  import rospy

  <<get_yaw>>
  <<to_local_coordinates>>

  class WaypointTracker(object):
      def __init__(self):
          self.base_waypoints = None
          self.base_waypoints_num = None
          self.pose = None

          self.last_closest_front_waypoint_index = 0
          # this is a super_class, so it will not start loop nor spin()
          # it expects the subclass will implement the appropriate

      <<base_waypoints_process>>
      <<current_pose_cb>>
      <<get_closest_waypoint>>
      <<distance>>
      <<distance_two_indices>>
#+END_SRC

** base_waypoints_process

    - Subscribe to /base_waypoint has been done in the __init__
    - implement the callback to store it and declare its availability.
    - compute the distance from the start of the base_waypoints to a base_waypoint stored into an array self.dist_to_here_from_start::
    the i_th element is the distance from the 0_th waypoint to the (i)_th waypoint.
    - also record the shortest distance to neighbor
    - 11/13 ::
               add back the computation of self.shortest_dist_to_next_waypoint
    in order to optimize the computation of the waypoint index of the traffic lights.

#+NAME:base_waypoints_process
#+BEGIN_SRC python :noweb tangle :tangle
  def base_waypoints_process(self, msg):
      # DONE: Implement
      waypoints = msg.waypoints
      if self.base_waypoints is None:
          # unsubscribe to the waypoint messages, no longer needed
          self.base_waypoints_sub.unregister()
          self.subscriber_waypoints = None

          self.base_waypoints_num = len(waypoints)

          # process the waypoints here
          self.dist_to_here_from_start = []
          self.base_waypoints = []
          dist = 0
          dist_so_far = 0
          self.shortest_dist_to_next_waypoint = 0
          for i in range(self.base_waypoints_num):
              dist_so_far += dist
              self.dist_to_here_from_start.append(dist_so_far)

              # do a deep copy of the data, to keep the data from lose
              # just to be safe, simply do shallow copy seems still working
              # by self.base_waypoints = waypoints
              self.base_waypoints.append(copy.deepcopy(waypoints[i]))
              # distance to the next waypoint
              if (i < self.base_waypoints_num-1):
                  dist = (
                      self.distance_two_indices(waypoints,  # the (i+1)_th element has not been copied yet
                                                i, (i+1) % self.base_waypoints_num))
              # end of if (i < self.base_waypoints_num-1)
              if (dist < self.shortest_dist_to_next_waypoint):
                  self.shortest_dist_to_next_waypoint = dist
              # end of if (dist < self.shortest_dist_to_next_waypoint)
          # end of for i in range(self.base_waypoints_num - 1)
      # end of if self.base_waypoints is None
#+END_SRC

