waypoint_tracker.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-11-28 Tue 13:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Waypoint Traceback</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yu-shen" />
</head>
<body>
<div id="content">
<h1 class="title">Waypoint Traceback</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2f6e06c">1. WaypointTracker</a>
<ul>
<li><a href="#org7440f9b">1.1. base<sub>waypoints</sub><sub>process</sub></a></li>
<li><a href="#org3de3eb2">1.2. current<sub>pose</sub><sub>cb</sub></a></li>
<li><a href="#org0f1fde7">1.3. get<sub>closest</sub><sub>waypoint</sub></a></li>
<li><a href="#org65c12e7">1.4. distance</a></li>
<li><a href="#orga6238aa">1.5. distance<sub>two</sub><sub>indices</sub></a></li>
<li><a href="#orgb628e8c">1.6. to convert a global coordinates to local coordinates:</a></li>
<li><a href="#orge273a94">1.7. How to calculate my<sub>car</sub>'s yaw angle, given its orientation in quaternion:</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
This is a super class to capture the common functionality of waypoint updater and tl<sub>dectector</sub> for
waypoint related functionality.
</p>

<div id="outline-container-org2f6e06c" class="outline-2">
<h2 id="org2f6e06c"><span class="section-number-2">1</span> WaypointTracker</h2>
<div class="outline-text-2" id="text-1">
<p>
A super-class for both WaypointTracker and TLDetector
</p>

<p>
<code>waypoint-tracker</code>:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> copy
<span style="color: #4f97d7; font-weight: bold;">import</span> math
&lt;&lt;get_yaw&gt;&gt;
&lt;&lt;to_local_coordinates&gt;&gt;

<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">WaypointTracker</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">object</span><span style="color: #4f97d7;">)</span>:
    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__init__</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span><span style="color: #4f97d7;">)</span>:
        <span style="color: #4f97d7; font-weight: bold;">self</span>.base_waypoints = <span style="color: #a45bad;">None</span>
        <span style="color: #4f97d7; font-weight: bold;">self</span>.base_waypoints_num = <span style="color: #a45bad;">None</span>
        <span style="color: #4f97d7; font-weight: bold;">self</span>.pose = <span style="color: #a45bad;">None</span>

        <span style="color: #4f97d7; font-weight: bold;">self</span>.last_closest_front_waypoint_index = <span style="color: #a45bad;">0</span>
        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">this is a super_class, so it will not start loop nor spin()</span>
        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">it expects the subclass will implement the appropriate</span>

    &lt;&lt;base_waypoints_process&gt;&gt;
    &lt;&lt;current_pose_cb&gt;&gt;
    &lt;&lt;get_closest_waypoint&gt;&gt;
    &lt;&lt;distance&gt;&gt;
    &lt;&lt;distance_two_indices&gt;&gt;
</pre>
</div>
</div>

<div id="outline-container-org7440f9b" class="outline-3">
<h3 id="org7440f9b"><span class="section-number-3">1.1</span> base<sub>waypoints</sub><sub>process</sub></h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Subscribe to /base<sub>waypoint</sub> has been done in the <span class="underline"><span class="underline">init</span></span></li>
<li>implement the callback to store it and declare its availability.</li>
<li>compute the distance from the start of the base<sub>waypoints</sub> to a base<sub>waypoint</sub> stored into an array self.dist<sub>to</sub><sub>here</sub><sub>from</sub><sub>start</sub>::</li>
</ul>
<p>
the i<sub>th</sub> element is the distance from the 0<sub>th</sub> waypoint to the (i)<sub>th</sub> waypoint.
</p>
<ul class="org-ul">
<li>also record the shortest distance to neighbor</li>
<li id="11/13">add back the computation of self.shortest<sub>dist</sub><sub>to</sub><sub>next</sub><sub>waypoint</sub></li>
</ul>
<p>
in order to optimize the computation of the waypoint index of the traffic lights.
</p>

<p>
<code>base_waypoints_process</code>:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">base_waypoints_process</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span>, msg<span style="color: #4f97d7;">)</span>:
    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #afd8af;">DONE</span><span style="color: #2aa1ae; background-color: #292e34;">: Implement</span>
    <span style="color: #7590db;">waypoints</span> = msg.waypoints
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7; font-weight: bold;">self</span>.base_waypoints <span style="color: #4f97d7; font-weight: bold;">is</span> <span style="color: #a45bad;">None</span>:
        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">unsubscribe to the waypoint messages, no longer needed</span>
        <span style="color: #4f97d7; font-weight: bold;">self</span>.base_waypoints_sub.unregister<span style="color: #4f97d7;">()</span>
        <span style="color: #4f97d7; font-weight: bold;">self</span>.subscriber_waypoints = <span style="color: #a45bad;">None</span>

        <span style="color: #4f97d7; font-weight: bold;">self</span>.base_waypoints_num = <span style="color: #4f97d7;">len</span><span style="color: #4f97d7;">(</span>waypoints<span style="color: #4f97d7;">)</span>

        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">process the waypoints here</span>
        <span style="color: #4f97d7; font-weight: bold;">self</span>.dist_to_here_from_start = <span style="color: #4f97d7;">[]</span>
        <span style="color: #4f97d7; font-weight: bold;">self</span>.base_waypoints = <span style="color: #4f97d7;">[]</span>
        <span style="color: #7590db;">dist</span> = <span style="color: #a45bad;">0</span>
        <span style="color: #7590db;">dist_so_far</span> = <span style="color: #a45bad;">0</span>
        <span style="color: #4f97d7; font-weight: bold;">self</span>.shortest_dist_to_next_waypoint = <span style="color: #a45bad;">0</span>
        <span style="color: #4f97d7; font-weight: bold;">for</span> i <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span>.base_waypoints_num<span style="color: #4f97d7;">)</span>:
            <span style="color: #7590db;">dist_so_far</span> += dist
            <span style="color: #4f97d7; font-weight: bold;">self</span>.dist_to_here_from_start.append<span style="color: #4f97d7;">(</span>dist_so_far<span style="color: #4f97d7;">)</span>

            <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">do a deep copy of the data, to keep the data from lose</span>
            <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">just to be safe, simply do shallow copy seems still working</span>
            <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">by self.base_waypoints = waypoints</span>
            <span style="color: #4f97d7; font-weight: bold;">self</span>.base_waypoints.append<span style="color: #4f97d7;">(</span>copy.deepcopy<span style="color: #bc6ec5;">(</span>waypoints<span style="color: #2d9574;">[</span>i<span style="color: #2d9574;">]</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
            <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">distance to the next waypoint</span>
            <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7;">(</span>i &lt; <span style="color: #4f97d7; font-weight: bold;">self</span>.base_waypoints_num-<span style="color: #a45bad;">1</span><span style="color: #4f97d7;">)</span>:
                <span style="color: #7590db;">dist</span> = <span style="color: #4f97d7;">(</span>
                    <span style="color: #4f97d7; font-weight: bold;">self</span>.distance_two_indices<span style="color: #bc6ec5;">(</span>waypoints,  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">the (i+1)_th element has not been copied yet</span>
                                              i, <span style="color: #2d9574;">(</span>i+<span style="color: #a45bad;">1</span><span style="color: #2d9574;">)</span> % <span style="color: #4f97d7; font-weight: bold;">self</span>.base_waypoints_num<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
            <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">end of if (i &lt; self.base_waypoints_num-1)</span>
            <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7;">(</span>dist &lt; <span style="color: #4f97d7; font-weight: bold;">self</span>.shortest_dist_to_next_waypoint<span style="color: #4f97d7;">)</span>:
                <span style="color: #4f97d7; font-weight: bold;">self</span>.shortest_dist_to_next_waypoint = dist
            <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">end of if (dist &lt; self.shortest_dist_to_next_waypoint)</span>
        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">end of for i in range(self.base_waypoints_num - 1)</span>
    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">end of if self.base_waypoints is None</span>
</pre>
</div>
</div>
</div>
