waypoint_tracker.org
** current_pose_cb
    - Subscribe to /current_pose is done in __init__

    - 11/6 ::
    change pose_cb only update the self.pose message, moving the function of generating waypoints ahead to self.loop.
    This is to make the call back more time responsive to improve overall system predictability.
    Only accept message when Waypoint_Updater is ready to process, otherwise reject /current_pose update to avoid delay.

#+NAME:current_pose_cb
#+BEGIN_SRC python :noweb tangle :tangle
  def current_pose_cb(self, msg):
      # WORKING: Implement
      #
      if self.pose is None:       # ready to process message
          self.pose = msg
      # end of if self.pose is None
      # otherwise, the current message is being processed, rejected the coming message and expect to receive more updated next one.
#+END_SRC

** get_closest_waypoint
#+NAME:get_closest_waypoint_hector
#+BEGIN_SRC python :noweb tangle :tangle
      def get_closest_waypoint(self, pose):

          closest_len = 100000
          closest_index = 0

          waypoints = self.base_waypoints

          for i in range(len(waypoints)):
              waypoint = waypoints[i].pose.pose.position
              d = self.dist_hector(pose.position, waypoint)
              if d < closest_len:
                  closest_len = d
                  closest_index = i
              # end of if d < closest_len:
          # end of for i in range(len(waypoints))
          return closest_index
#+END_SRC

Need to have dist_hector to make it working.

It only tries to find the closest in distance, regardless of orientation.

#+NAME:get_closest_waypoint
#+BEGIN_SRC python :noweb tangle :tangle
  def get_closest_waypoint(self, pose):
      if self.base_waypoints_num is not None:
          current_pose = pose.position
          current_orientation = pose.orientation
          yaw = get_yaw(current_orientation)

          # Compute the waypoints ahead of the current_pose

          local_x = -1
          i = self.last_closest_front_waypoint_index - 1
          while ((i < self.base_waypoints_num-1) and (local_x <= 0)):
              i = (i + 1) # % self.base_waypoints_num
              # rospy.loginfo('index of i, searching for the nearest waypoint in front: %r' % i)
              waypoint = self.base_waypoints[i]
              w_pos = waypoint.pose.pose.position
              local_x, local_y = to_local_coordinates(current_pose.x, current_pose.y, yaw,
                                                      w_pos.x, w_pos.y)
          # end of while (local_x < 0)
          self.last_closest_front_waypoint_index = i
          # make the update last_closest_front_waypoint_index atomic with the search of the next one.
          return i
      # end of if self.base_waypoints_num is not None
      return None
#+END_SRC

** distance

The computation of the distance between two waypoints can be done by the distances of those
starting from the start to the i_th node, and j_th node.

This is an optimization in computation.

#+NAME:distance
#+BEGIN_SRC python :noweb tangle :tangle
  def distance(self, wp1, wp2):
      if (wp1 < wp2):
          start, end = wp1, wp2
      else:
          start, end = wp2, wp1
      # end of if (wp1 < wp2)

      dist = self.dist_to_here_from_start[end] - self.dist_to_here_from_start[start]
      return dist
#+END_SRC

** distance_two_indices

The distance function used to calculate the initial distance between two adjacent waypoints. It's needed before the distance from
base_waypoint start to the a base_waypoint is calculated.

#+NAME:distance_two_indices
#+BEGIN_SRC python :noweb tangle :tangle
  def distance_two_indices(self, waypoints, i, j):
    a = waypoints[i].pose.pose.position
    b = waypoints[j].pose.pose.position
    return math.sqrt((a.x-b.x)**2 + (a.y-b.y)**2  + (a.z-b.z)**2)
#+END_SRC

