waypoint_tracker.html

<div id="outline-container-org3de3eb2" class="outline-3">
<h3 id="org3de3eb2"><span class="section-number-3">1.2</span> current<sub>pose</sub><sub>cb</sub></h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Subscribe to /current<sub>pose</sub> is done in <span class="underline"><span class="underline">init</span></span></li>

<li id="11/6"></li>
</ul>
<p>
change pose<sub>cb</sub> only update the self.pose message, moving the function of generating waypoints ahead to self.loop.
This is to make the call back more time responsive to improve overall system predictability.
Only accept message when Waypoint<sub>Updater</sub> is ready to process, otherwise reject /current<sub>pose</sub> update to avoid delay.
</p>

<p>
<code>current_pose_cb</code>:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">current_pose_cb</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span>, msg<span style="color: #4f97d7;">)</span>:
    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">WORKING: Implement</span>
    <span style="color: #2aa1ae; background-color: #292e34;">#</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7; font-weight: bold;">self</span>.pose <span style="color: #4f97d7; font-weight: bold;">is</span> <span style="color: #a45bad;">None</span>:       <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">ready to process message</span>
        <span style="color: #4f97d7; font-weight: bold;">self</span>.pose = msg
    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">end of if self.pose is None</span>
    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">otherwise, the current message is being processed, rejected the coming message and expect to receive more updated next one.</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0f1fde7" class="outline-3">
<h3 id="org0f1fde7"><span class="section-number-3">1.3</span> get<sub>closest</sub><sub>waypoint</sub></h3>
<div class="outline-text-3" id="text-1-3">
<p>
<code>get_closest_waypoint</code>:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">get_closest_waypoint</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span>, pose<span style="color: #4f97d7;">)</span>:
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7; font-weight: bold;">self</span>.base_waypoints_num:
        <span style="color: #7590db;">current_pose</span> = pose.position
        <span style="color: #7590db;">current_orientation</span> = pose.orientation
        <span style="color: #7590db;">yaw</span> = get_yaw<span style="color: #4f97d7;">(</span>current_orientation<span style="color: #4f97d7;">)</span>

        <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Compute the waypoints ahead of the current_pose</span>

        <span style="color: #7590db;">local_x</span> = -<span style="color: #a45bad;">1</span>
        <span style="color: #7590db;">i</span> = <span style="color: #4f97d7; font-weight: bold;">self</span>.last_closest_front_waypoint_index - <span style="color: #a45bad;">1</span>
        <span style="color: #4f97d7; font-weight: bold;">while</span> <span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span>i &lt; <span style="color: #4f97d7; font-weight: bold;">self</span>.base_waypoints_num-<span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span> <span style="color: #4f97d7; font-weight: bold;">and</span> <span style="color: #bc6ec5;">(</span>local_x &lt;= <span style="color: #a45bad;">0</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>:
            <span style="color: #7590db;">i</span> = <span style="color: #4f97d7;">(</span>i + <span style="color: #a45bad;">1</span><span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">% self.base_waypoints_num</span>
            <span style="color: #7590db;">waypoint</span> = <span style="color: #4f97d7; font-weight: bold;">self</span>.base_waypoints<span style="color: #4f97d7;">[</span>i<span style="color: #4f97d7;">]</span>
            <span style="color: #7590db;">w_pos</span> = waypoint.pose.pose.position
            <span style="color: #7590db;">local_x</span>, <span style="color: #7590db;">local_y</span> = to_local_coordinates<span style="color: #4f97d7;">(</span>current_pose.x, current_pose.y, yaw,
                                                    w_pos.x, w_pos.y<span style="color: #4f97d7;">)</span>
            <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">end of while (local_x &lt; 0)</span>
        <span style="color: #4f97d7; font-weight: bold;">return</span> i
    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">end of if self.base_waypoints_num</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">None</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org65c12e7" class="outline-3">
<h3 id="org65c12e7"><span class="section-number-3">1.4</span> distance</h3>
<div class="outline-text-3" id="text-1-4">
<p>
The computation of the distance between two waypoints can be done by the distances of those
starting from the start to the i<sub>th</sub> node, and j<sub>th</sub> node.
</p>

<p>
This is an optimization in computation.
</p>

<p>
<code>distance</code>:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">distance</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span>, wp1, wp2<span style="color: #4f97d7;">)</span>:
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7;">(</span>wp1 &lt; wp2<span style="color: #4f97d7;">)</span>:
        <span style="color: #7590db;">start</span>, <span style="color: #7590db;">end</span> = wp1, wp2
    <span style="color: #4f97d7; font-weight: bold;">else</span>:
        <span style="color: #7590db;">start</span>, <span style="color: #7590db;">end</span> = wp2, wp1
    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">end of if (wp1 &lt; wp2)</span>

    <span style="color: #7590db;">dist</span> = <span style="color: #4f97d7; font-weight: bold;">self</span>.dist_to_here_from_start<span style="color: #4f97d7;">[</span>end<span style="color: #4f97d7;">]</span> - <span style="color: #4f97d7; font-weight: bold;">self</span>.dist_to_here_from_start<span style="color: #4f97d7;">[</span>start<span style="color: #4f97d7;">]</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> dist
</pre>
</div>
</div>
</div>

<div id="outline-container-orga6238aa" class="outline-3">
<h3 id="orga6238aa"><span class="section-number-3">1.5</span> distance<sub>two</sub><sub>indices</sub></h3>
<div class="outline-text-3" id="text-1-5">
<p>
The distance function used to calculate the initial distance between two adjacent waypoints. It's needed before the distance from
base<sub>waypoint</sub> start to the a base<sub>waypoint</sub> is calculated.
</p>

<p>
<code>distance_two_indices</code>:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">distance_two_indices</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span>, waypoints, i, j<span style="color: #4f97d7;">)</span>:
  <span style="color: #7590db;">a</span> = waypoints<span style="color: #4f97d7;">[</span>i<span style="color: #4f97d7;">]</span>.pose.pose.position
  <span style="color: #7590db;">b</span> = waypoints<span style="color: #4f97d7;">[</span>j<span style="color: #4f97d7;">]</span>.pose.pose.position
  <span style="color: #4f97d7; font-weight: bold;">return</span> math.sqrt<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span>a.x-b.x<span style="color: #bc6ec5;">)</span>**<span style="color: #a45bad;">2</span> + <span style="color: #bc6ec5;">(</span>a.y-b.y<span style="color: #bc6ec5;">)</span>**<span style="color: #a45bad;">2</span>  + <span style="color: #bc6ec5;">(</span>a.z-b.z<span style="color: #bc6ec5;">)</span>**<span style="color: #a45bad;">2</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>
