waypoint_tracker.org
** to convert a global coordinates to local coordinates:
    It's based on the wiki:
    https://en.wikipedia.org/wiki/Rotation_matrix

    This implementation assumes the rotation has positive value from the global x-axis to the local x-axis
    counter-clockwise.

This following one works based on the experiment.

   #+NAME:to_local_coordinates
   #+BEGIN_SRC python :noweb tangle :tangle
     def to_local_coordinates(local_origin_x, local_origin_y, rotation, x, y):
         """
         compute the local coordinates for the global x, y coordinates values,
         given the local_origin_x, local_origin_y, and the rotation of the local x-axis.
         Assume the rotation is radius
         """
         shift_x = x - local_origin_x
         shift_y = y - local_origin_y

         cos_rotation = math.cos(rotation)
         sin_rotation = math.sin(rotation)

         local_x =  cos_rotation*shift_x + sin_rotation*shift_y
         local_y = -sin_rotation*shift_x + cos_rotation*shift_y  # according to John Chen's
         # assuming the orientation angle clockwise being positive
         return local_x, local_y
   #+END_SRC

Based on experiment, the following does not work.

#+NAME:to_local_coordinates_counter_clockwise_orientation
   #+BEGIN_SRC python :noweb tangle :tangle
  def to_local_coordinates(local_origin_x, local_origin_y, rotation, x, y):
      """
      compute the local coordinates for the global x, y coordinates values,
      given the local_origin_x, local_origin_y, and the rotation of the local x-axis.
      Assume the rotation is radius
      """
      shift_x = x - local_origin_x
      shift_y = y - local_origin_y

      cos_rotation = math.cos(rotation)
      sin_rotation = math.sin(rotation)

      local_x = cos_rotation*shift_x - sin_rotation*shift_y
      local_y = sin_rotation*shift_x + cos_rotation*shift_y  # according to John Chen's
      # assuming the orientation angle counter-clockwise being positive
      return local_x, local_y
   #+END_SRC


** How to calculate my_car's yaw angle, given its orientation in quaternion:

      The unit of the returned value is in radius?
      To check the documentation of transformations.euler_from_quaternion

#+NAME:get_yaw
#+BEGIN_SRC python :noweb tangle :tangle
  import tf as tf_ros                      # This is of ROS geometry, not of TensorFlow!
  def get_yaw(orientation):
      """
      Compute yaw from orientation, which is in Quaternion.
      """
      # orientation = msg.pose.orientation
      euler = tf_ros.transformations.euler_from_quaternion([
          orientation.x,
          orientation.y,
          orientation.z,
          orientation.w])
      yaw = euler[2]
      return yaw
#+END_SRC
