waypoint_tracker.html

<div id="outline-container-orgb628e8c" class="outline-3">
<h3 id="orgb628e8c"><span class="section-number-3">1.6</span> to convert a global coordinates to local coordinates:</h3>
<div class="outline-text-3" id="text-1-6">
<p>
It's based on the wiki:
<a href="https://en.wikipedia.org/wiki/Rotation_matrix">https://en.wikipedia.org/wiki/Rotation_matrix</a>
</p>

<p>
This implementation assumes the rotation has positive value from the global x-axis to the local x-axis
counter-clockwise.
</p>

<p>
This following one works based on the experiment.
</p>

<p>
<code>to_local_coordinates</code>:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">to_local_coordinates</span><span style="color: #4f97d7;">(</span>local_origin_x, local_origin_y, rotation, x, y<span style="color: #4f97d7;">)</span>:
    <span style="color: #2aa1ae;">"""</span>
<span style="color: #2aa1ae;">    compute the local coordinates for the global x, y coordinates values,</span>
<span style="color: #2aa1ae;">    given the local_origin_x, local_origin_y, and the rotation of the local x-axis.</span>
<span style="color: #2aa1ae;">    Assume the rotation is radius</span>
<span style="color: #2aa1ae;">    """</span>
    <span style="color: #7590db;">shift_x</span> = x - local_origin_x
    <span style="color: #7590db;">shift_y</span> = y - local_origin_y

    <span style="color: #7590db;">cos_rotation</span> = math.cos<span style="color: #4f97d7;">(</span>rotation<span style="color: #4f97d7;">)</span>
    <span style="color: #7590db;">sin_rotation</span> = math.sin<span style="color: #4f97d7;">(</span>rotation<span style="color: #4f97d7;">)</span>

    <span style="color: #7590db;">local_x</span> =  cos_rotation*shift_x + sin_rotation*shift_y
    <span style="color: #7590db;">local_y</span> = -sin_rotation*shift_x + cos_rotation*shift_y  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">according to John Chen's</span>
    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">assuming the orientation angle clockwise being positive</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> local_x, local_y
</pre>
</div>

<p>
Based on experiment, the following does not work.
</p>

<p>
<code>to_local_coordinates_counter_clockwise_orientation</code>:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">to_local_coordinates</span><span style="color: #4f97d7;">(</span>local_origin_x, local_origin_y, rotation, x, y<span style="color: #4f97d7;">)</span>:
    <span style="color: #2aa1ae;">"""</span>
<span style="color: #2aa1ae;">    compute the local coordinates for the global x, y coordinates values,</span>
<span style="color: #2aa1ae;">    given the local_origin_x, local_origin_y, and the rotation of the local x-axis.</span>
<span style="color: #2aa1ae;">    Assume the rotation is radius</span>
<span style="color: #2aa1ae;">    """</span>
    <span style="color: #7590db;">shift_x</span> = x - local_origin_x
    <span style="color: #7590db;">shift_y</span> = y - local_origin_y

    <span style="color: #7590db;">cos_rotation</span> = math.cos<span style="color: #4f97d7;">(</span>rotation<span style="color: #4f97d7;">)</span>
    <span style="color: #7590db;">sin_rotation</span> = math.sin<span style="color: #4f97d7;">(</span>rotation<span style="color: #4f97d7;">)</span>

    <span style="color: #7590db;">local_x</span> = cos_rotation*shift_x - sin_rotation*shift_y
    <span style="color: #7590db;">local_y</span> = sin_rotation*shift_x + cos_rotation*shift_y  <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">according to John Chen's</span>
    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">assuming the orientation angle counter-clockwise being positive</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> local_x, local_y
</pre>
</div>
</div>
</div>


<div id="outline-container-orge273a94" class="outline-3">
<h3 id="orge273a94"><span class="section-number-3">1.7</span> How to calculate my<sub>car</sub>'s yaw angle, given its orientation in quaternion:</h3>
<div class="outline-text-3" id="text-1-7">
<p>
The unit of the returned value is in radius?
To check the documentation of transformations.euler<sub>from</sub><sub>quaternion</sub>
</p>

<p>
<code>get_yaw</code>:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> tf <span style="color: #4f97d7; font-weight: bold;">as</span> tf_ros                      <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">This is of ROS geometry, not of TensorFlow!</span>
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">get_yaw</span><span style="color: #4f97d7;">(</span>orientation<span style="color: #4f97d7;">)</span>:
    <span style="color: #2aa1ae;">"""</span>
<span style="color: #2aa1ae;">    Compute yaw from orientation, which is in Quaternion.</span>
<span style="color: #2aa1ae;">    """</span>
    <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">orientation = msg.pose.orientation</span>
    <span style="color: #7590db;">euler</span> = tf_ros.transformations.euler_from_quaternion<span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">[</span>
        orientation.x,
        orientation.y,
        orientation.z,
        orientation.w<span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span>
    <span style="color: #7590db;">yaw</span> = euler<span style="color: #4f97d7;">[</span><span style="color: #a45bad;">2</span><span style="color: #4f97d7;">]</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> yaw
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: \today</p>
<p class="author">Author: yu-shen</p>
<p class="date">Created: 2017-11-28 Tue 13:55</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
